In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import statistics as sts

In [3]:
ds = pd.read_csv('nba.csv')
ds.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [4]:
ds.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [5]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [6]:
ds['Name']=ds['Name'].astype('string')
ds['Team']=ds['Team'].astype('string')
ds['College']=ds['College'].astype('string')
ds['Position']=ds['Position'].astype('string')

In [7]:
ds.dtypes

Name        string[python]
Team        string[python]
Number             float64
Position    string[python]
Age                float64
Height              object
Weight             float64
College     string[python]
Salary             float64
dtype: object

In [8]:
rows = ds.loc[ds['Age'].isna()] #return row with null value
print(rows)

     Name  Team  Number Position  Age Height  Weight College  Salary
457  <NA>  <NA>     NaN     <NA>  NaN    NaN     NaN    <NA>     NaN

In [9]:
#since all values are null delete the row
ds.dropna(subset="Age",inplace=True)

In [10]:
ds.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary      11
dtype: int64

In [11]:
ds['Age']=ds['Age'].astype(int) #convertable only when there is no null value

In [12]:
ds.dtypes

Name        string[python]
Team        string[python]
Number             float64
Position    string[python]
Age                  int64
Height              object
Weight             float64
College     string[python]
Salary             float64
dtype: object

In [13]:
#replace college unknow since string dtype cannot take mode
ds['College'].fillna('Unknown',inplace=True)
ds['Salary']=ds['Salary'].fillna(ds['Salary'].mean()) #replace NaN salary with mean

In [14]:
ds.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [21]:
mean_age = ds['Age'].mean()
mode_age = ds['Age'].mode()
median_age = ds['Age'].median()
sd_age = sts.stdev(ds['Age'])
max_age = ds['Age'].max()
min_age = ds['Age'].min()
count_age = ds['Age'].value_counts()
print('Mean of age: ',mean_age)
print('Mode of age: ',mode_age)
print('Median of age: ',median_age)
print('Standard Deviation: ',sd_age)
print('Max: ',max_age)
print('Min: ',min_age)
print('Value Count: ',count_age)

Mean of age:  26.938730853391686
Mode of age:  0    24
Name: Age, dtype: int64
Median of age:  26.0
Standard Deviation:  4.404016424405833
Max:  40
Min:  19
Value Count:  Age
24    47
25    45
27    41
23    41
26    36
28    31
30    31
29    28
22    26
31    22
20    19
21    19
33    14
32    13
34    10
36    10
35     9
37     4
38     4
40     3
39     2
19     2
Name: count, dtype: int64

In [16]:
#group height and age together
group_height = ds.groupby(ds['Height']) #searate dataframe based on unique height
group_height.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25,6-2,180.0,Texas,7.730337e+06
1,Jae Crowder,Boston Celtics,99.0,SF,25,6-6,235.0,Marquette,6.796117e+06
2,John Holland,Boston Celtics,30.0,SG,27,6-5,205.0,Boston University,4.842684e+06
3,R.J. Hunter,Boston Celtics,28.0,SG,22,6-5,185.0,Georgia State,1.148640e+06
4,Jonas Jerebko,Boston Celtics,8.0,PF,29,6-10,231.0,Unknown,5.000000e+06
...,...,...,...,...,...,...,...,...,...
275,Alexis Ajinca,New Orleans Pelicans,42.0,C,28,7-2,248.0,Unknown,4.389607e+06
302,Boban Marjanovic,San Antonio Spurs,40.0,C,27,7-3,290.0,Unknown,1.200000e+06
322,Walter Tavares,Atlanta Hawks,22.0,C,24,7-3,260.0,Unknown,1.000000e+06
329,Spencer Hawes,Charlotte Hornets,0.0,PF,28,7-1,245.0,Washington,6.110034e+06
455,Tibor Pleiss,Utah Jazz,21.0,C,26,7-3,256.0,Unknown,2.900000e+06

In [17]:
group_height['Weight'].describe() # select only the weight column and compute its statistics

        count        mean        std    min     25%    50%     75%    max
Height
5-11      3.0  181.666667  11.547005  175.0  175.00  175.0  185.00  195.0
5-9       1.0  185.000000        NaN  185.0  185.00  185.0  185.00  185.0
6-0      10.0  183.500000  13.074572  161.0  175.00  184.0  188.75  205.0
6-1      16.0  180.750000  11.174375  165.0  172.75  177.0  187.00  205.0
6-10     47.0  244.872340  15.613006  210.0  235.00  245.0  251.00  289.0
6-11     40.0  247.250000  19.986855  200.0  234.25  245.0  261.25  307.0
6-2      16.0  185.375000   9.569918  165.0  180.00  185.0  191.25  200.0
6-3      33.0  192.575758   8.329279  172.0  189.00  190.0  200.00  208.0
6-4      29.0  203.931034  10.885544  185.0  195.00  205.0  213.00  220.0
6-5      32.0  203.718750  12.596042  179.0  195.00  205.0  210.00  230.0
6-6      42.0  211.190476  14.204496  175.0  203.50  211.0  220.00  245.0
6-7      45.0  217.422222  14.962816  185.0  208.00  220.0  226.00  260.0
6-8      43.0  228.046512  15.198611  198.0  218.00  228.0  240.00  260.0
6-9      59.0  233.966102  16.074145  186.0  222.50  235.0  249.00  260.0
7-0      27.0  251.407407  15.102876  220.0  240.00  253.0  262.50  280.0
7-1       7.0  252.142857  12.198751  240.0  245.00  245.0  257.50  275.0
7-2       3.0  254.333333  13.650397  245.0  246.50  248.0  259.00  270.0
7-3       4.0  261.500000  20.872630  240.0  252.00  258.0  267.50  290.0

In [24]:
#group age and salary
group_sal = ds.groupby(['Age','Salary'])
print(group_sal.first())
group_sal['Age'].describe()

                         Name                    Team  Number Position Height  \
Age Salary
19  1733040.0   Rashad Vaughn         Milwaukee Bucks    20.0       SG    6-6
    2127840.0    Devin Booker            Phoenix Suns     1.0       SG    6-6
20  525093.0   Christian Wood      Philadelphia 76ers    35.0       PF   6-11
    1131960.0    Kevon Looney   Golden State Warriors    36.0       SF    6-9
    1282080.0      Tyus Jones  Minnesota Timberwolves     1.0       PG    6-2
...                       ...                     ...     ...      ...    ...
39  947726.0   Pablo Prigioni    Los Angeles Clippers     9.0       PG    6-3
    4088019.0    Vince Carter       Memphis Grizzlies    15.0       SG    6-6
40  250750.0     Andre Miller       San Antonio Spurs    24.0       PG    6-3
    5250000.0      Tim Duncan       San Antonio Spurs    21.0        C   6-11
    8500000.0   Kevin Garnett  Minnesota Timberwolves    21.0       PF   6-11

               Weight         College
Age Salary
19  1733040.0   202.0            UNLV
    2127840.0   206.0        Kentucky
20  525093.0    220.0            UNLV
    1131960.0   220.0            UCLA
    1282080.0   195.0            Duke
...               ...             ...
39  947726.0    185.0         Unknown
    4088019.0   220.0  North Carolina
40  250750.0    200.0            Utah
    5250000.0   250.0     Wake Forest
    8500000.0   240.0         Unknown

[402 rows x 7 columns]

               count  mean  std   min   25%   50%   75%   max
Age Salary
19  1733040.0    1.0  19.0  NaN  19.0  19.0  19.0  19.0  19.0
    2127840.0    1.0  19.0  NaN  19.0  19.0  19.0  19.0  19.0
20  525093.0     2.0  20.0  0.0  20.0  20.0  20.0  20.0  20.0
    1131960.0    1.0  20.0  NaN  20.0  20.0  20.0  20.0  20.0
    1282080.0    1.0  20.0  NaN  20.0  20.0  20.0  20.0  20.0
...              ...   ...  ...   ...   ...   ...   ...   ...
39  947726.0     1.0  39.0  NaN  39.0  39.0  39.0  39.0  39.0
    4088019.0    1.0  39.0  NaN  39.0  39.0  39.0  39.0  39.0
40  250750.0     1.0  40.0  NaN  40.0  40.0  40.0  40.0  40.0
    5250000.0    1.0  40.0  NaN  40.0  40.0  40.0  40.0  40.0
    8500000.0    1.0  40.0  NaN  40.0  40.0  40.0  40.0  40.0

[402 rows x 8 columns]

In [26]:
group_age = ds.groupby(ds['Age'])
group_age['Salary'].describe()

,count,mean,std,min,25%,50%,75%,max
Age,,,,,,,,
19,2.0,1.930440e+06,2.791658e+05,1.733040e+06,1.831740e+06,1930440.0,2.029140e+06,2127840.0
20,19.0,2.725791e+06,1.510913e+06,5.250930e+05,1.636920e+06,2481720.0,3.954720e+06,5703600.0
21,19.0,2.067380e+06,1.412350e+06,5.250930e+05,1.235480e+06,1584480.0,2.084940e+06,5758680.0
22,26.0,2.357963e+06,1.517378e+06,5.250930e+05,1.169190e+06,1793880.0,3.366733e+06,6331404.0
23,41.0,2.171719e+06,2.728808e+06,3.088800e+04,6.500000e+05,1201440.0,2.891760e+06,16000000.0
24,47.0,3.830295e+06,4.702753e+06,5.250930e+05,9.236380e+05,1535880.0,4.751583e+06,16407501.0
25,45.0,3.951130e+06,4.508414e+06,5.572200e+04,9.472760e+05,1358880.0,5.543725e+06,15851950.0
26,36.0,6.866566e+06,6.100471e+06,1.342150e+05,1.336790e+06,3325000.0,1.256250e+07,17120106.0
27,41.0,6.632008e+06,6.752122e+06,5.572200e+04,1.035000e+06,3425510.0,1.123596e+07,20158622.0
28,31.0,5.101559e+06,4.244345e+06,2.061920e+05,1.843421e+06,4389607.0,6.190017e+06,19689000.0
29,28.0,6.174838e+06,4.786782e+06,1.114440e+05,2.205000e+06,5271862.5,9.322612e+06,16407500.0
30,31.0,6.990272e+06,5.332677e+06,9.472760e+05,3.099470e+06,5675000.0,9.000000e+06,22359364.0
31,22.0,8.511397e+06,7.170163e+06,9.472760e+05,3.000000e+06,5439487.0,1.347500e+07,22970500.0
32,13.0,7.716958e+06,7.451336e+06,2.953270e+05,3.135000e+06,5200000.0,1.121739e+07,22875000.0
33,14.0,3.930739e+06,4.354293e+06,2.006000e+05,1.119326e+06,2300000.0,4.040084e+06,13000000.0
34,10.0,7.606030e+06,5.653035e+06,2.618940e+05,4.512750e+06,6280675.5,9.103916e+06,20000000.0
35,9.0,3.615178e+06,2.259354e+06,9.472760e+05,1.499187e+06,3750000.0,4.842684e+06,7448760.0
36,10.0,2.238120e+06,1.550061e+06,9.472760e+05,9.472760e+05,1809826.0,2.888735e+06,5675000.0
37,4.0,1.079400e+07,9.606489e+06,4.842684e+06,4.960671e+06,6666667.0,1.250000e+07,25000000.0
38,4.0,1.840041e+06,1.496661e+06,2.228880e+05,7.661790e+05,1880638.0,2.954500e+06,3376000.0
39,2.0,2.517872e+06,2.220522e+06,9.477260e+05,1.732799e+06,2517872.5,3.302946e+06,4088019.0
40,3.0,4.666917e+06,4.155421e+06,2.507500e+05,2.750375e+06,5250000.0,6.875000e+06,8500000.0